---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviserRuleId.op_Equality(Autodesk.Revit.DB.PerformanceAdviserRuleId,Autodesk.Revit.DB.PerformanceAdviserRuleId)
source: html/21cbe148-6ec0-e754-be23-03cce34b3c12.htm
---
# Autodesk.Revit.DB.PerformanceAdviserRuleId.op_Equality Method

Compares two PerformanceAdviserRuleId instances.

## Syntax (C#)
```csharp
public static bool operator ==(
	PerformanceAdviserRuleId first,
	PerformanceAdviserRuleId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.PerformanceAdviserRuleId`) - The first PerformanceAdviserRuleId.
- **second** (`Autodesk.Revit.DB.PerformanceAdviserRuleId`) - The second PerformanceAdviserRuleId.

## Returns
True if the inputs are identical, false if they are different.